app/api/book_store/v1/books.rb

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        desc 'Return a specific book'
        route_param :id do
        get do
          book = Book.find(params[:id])